---
kind: other
id: AllMembers.T:Autodesk.Revit.DB.RepeaterBounds
source: html/0d1e7d25-1e64-6ab7-e288-5dd18b01f1b4.htm
---
# RepeaterBounds Members

Shifts the input coordinates in the cyclical dimensions so that they fall in the [lower bounds, upper bounds] range.